; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem strips-blocks-soc)
    (:domain BLOCKS)
    (:objects A B)
    (:init (ONTABLE A) 
           (ON B A) 
           (CLEAR B) 
           (HANDEMPTY))
    (:goal (AND (ONTABLE B) 
                (ON A B) 
                (CLEAR A))))

; plan
1. (unstack b a)
   deleted: (clear b) (handempty) (on b a)
   added: (holding b) (clear a)
   goals met: 1 of 3
2. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 2 of 3
3. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 1 of 3
4. (stack a b)
   deleted: (holding a) (clear b)
   added: (clear a) (handempty) (on a b)
   goals met: 3 of 3
